In [31]:
import pandas as pd
import os

In [32]:
data = {"f":["Jack","Mason","puahah"],"tenure":[3,5,7]}

In [65]:
df = pd.DataFrame(data, columns =["f","tenure"])
df.head()

        f  tenure
0    Jack       3
1   Mason       5
2  puahah       7

        tenure
tenure     1.0

In [34]:
pwd

'C:\\Users\\firat\\NewFolder1'

#csv veya excel veri Ã§ekme

In [75]:
df = pd.read_csv("C:/Users/firat/NewFolder1/434.csv",sep=';')

In [76]:
df.head()

        Date  Daily Cases  Total Case  Total Cars on Traffic  Unnamed: 4
0  4.01.2020         2148       15679               18696665         NaN
1  4.02.2020         2456       18135               17770314         NaN
2  4.03.2020         2786       20921               19651370         NaN
3  4.04.2020         3013       23934               13238808         NaN
4  4.05.2020         3135       27069                7448550         NaN

In [77]:
df.corr()

,Daily Cases,Total Case,Total Cars on Traffic,Unnamed: 4
Daily Cases,1.000000,-0.769326,-0.001534,NaN
Total Case,-0.769326,1.000000,0.003806,NaN
Total Cars on Traffic,-0.001534,0.003806,1.000000,NaN
Unnamed: 4,NaN,NaN,NaN,NaN